export default{
    getChartsData: () => {
        return{
            code:200,
            data:{
                orderData:{
                   date:['20191001','20191002','20191003','20191004','20191005','20191006','20191007'],
                    data :[{
                        苹果:"4342",
                        小米:"4432",
                        华为:"4576",
                        oppo:"3523",
                        vivo:"3364",
                        一加:"1352",
                    },
                    {
                      苹果:"4023",
                      小米:"2345",
                      华为:"4684",
                      oppo:"4023",
                      vivo:"1452",
                      一加:"2325",
                  },
                  {
                    苹果:"4556",
                    小米:"3245",
                    华为:"4324",
                    oppo:"4123",
                    vivo:"3221",
                    一加:"2231",
                },
                {
                  苹果:"4231",
                  小米:"4211",
                  华为:"4632",
                  oppo:"3214",
                  vivo:"4211",
                  一加:"4232",
              },
              {
                苹果:"4355",
                小米:"3245",
                华为:"4893",
                oppo:"4231",
                vivo:"2331",
                一加:"2224",
            },
            {
              苹果:"4523",
              小米:"3423",
              华为:"4321",
              oppo:"4222",
              vivo:"3123",
              一加:"2213",
          },
          {
            苹果:"5000",
            小米:"4230",
            华为:"5000",
            oppo:"4210",
            vivo:"4320",
            一加:"3212",
        },
                  ]

            },
                videoData: [
                    {
                      name: '小米',
                      value: 2999
                    },
                    {
                      name: '苹果',
                      value: 5999
                    },
                    {
                      name: 'vivo',
                      value: 1500
                    },
                    {
                      name: 'oppo',
                      value: 1999
                    },
                    {
                      name: '魅族',
                      value: 2200
                    },
                    {
                      name: '三星',
                      value: 4500
                    }
                  ],
                  // 柱状图
                  userData: [
                    {
                      date: '周一',
                      new: 5,
                      active: 200
                    },
                    {
                      date: '周二',
                      new: 10,
                      active: 500
                    },
                    {
                      date: '周三',
                      new: 12,
                      active: 550
                    },
                    {
                      date: '周四',
                      new: 60,
                      active: 800
                    },
                    {
                      date: '周五',
                      new: 65,
                      active: 550
                    },
                    {
                      date: '周六',
                      new: 53,
                      active: 770
                    },
                    {
                      date: '周日',
                      new: 33,
                      active: 170
                    }
                  ],
            }
        }
    }
}